---
kind: property
id: P:Autodesk.Revit.DB.TextNoteOptions.VerticalAlignment
source: html/56c58c33-e8b0-071f-db15-a3c7fba39fbb.htm
---
# Autodesk.Revit.DB.TextNoteOptions.VerticalAlignment Property

Vertical alignment of the text.

## Syntax (C#)
```csharp
public VerticalTextAlignment VerticalAlignment { get; set; }
```

## Remarks
Default is Top alignment.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration